polybassa/WyLight/cc3200/wyLightFirmware/firmware/main.c
	// Remove all profiles
	lRetVal = sl_WlanProfileDel(0xFF);
	ASSERT_ON_ERROR(__LINE__, lRetVal);

	// If the device is not in station-mode, try putting it in staion-mode
	if (ROLE_STA != lMode) {
		if (ROLE_AP == lMode) {
			// If the device is in AP mode, we need to wait for this event
			// before doing anything
			while (!IS_IP_ACQUIRED(g_ulStatus)) {
#ifndef SL_PLATFORM_MULTI_THREADED
				_SlNonOsMainLoopTask();
#endif
			}
		}

		// Switch to STA role and restart
		lRetVal = sl_WlanSetMode(ROLE_STA);
		ASSERT_ON_ERROR(__LINE__, lRetVal);

		lRetVal = sl_Stop(SL_STOP_TIMEOUT);
		ASSERT_ON_ERROR(__LINE__, lRetVal);

		lRetVal = sl_Start(0, 0, 0);
		ASSERT_ON_ERROR(__LINE__, lRetVal);

		// Check if the device is in station again
		if (ROLE_STA != lRetVal) {
			// We don't want to proceed if the device is not up in STA-mode
			return DEVICE_NOT_IN_STATION_MODE;
		}
	}

	//
	// Device in station-mode. Disconnect previous connection if any
	// The function returns 0 if 'Disconnected done', negative number if already
	// disconnected Wait for 'disconnection' event if 0 is returned, Ignore
	// other return-codes
	//
	lRetVal = sl_WlanDisconnect();
	if (0 == lRetVal) {
		// Wait
		while (IS_CONNECTED(g_ulStatus)) {
#ifndef SL_PLATFORM_MULTI_THREADED
			_SlNonOsMainLoopTask();
#endif
		}
	}

	// Enable DHCP client
	lRetVal = sl_NetCfgSet(SL_IPV4_STA_P2P_CL_DHCP_ENABLE, 1, 1, &ucVal);
	ASSERT_ON_ERROR(__LINE__, lRetVal);

	// Disable scan
	ucConfigOpt = SL_SCAN_POLICY(0);
	lRetVal = sl_WlanPolicySet(SL_POLICY_SCAN, ucConfigOpt, NULL, 0);
	ASSERT_ON_ERROR(__LINE__, lRetVal);

	// Set Tx power level for station mode
	// Number between 0-15, as dB offset from max power - 0 will set max power
	ucPower = 0;
	lRetVal = sl_WlanSet(SL_WLAN_CFG_GENERAL_PARAM_ID,
	WLAN_GENERAL_PARAM_OPT_STA_TX_POWER, 1, (unsigned char *) &ucPower);
	ASSERT_ON_ERROR(__LINE__, lRetVal);

	// Set PM policy to normal
	lRetVal = sl_WlanPolicySet(SL_POLICY_PM, SL_NORMAL_POLICY, NULL, 0);
	ASSERT_ON_ERROR(__LINE__, lRetVal);

	lRetVal = sl_Stop(SL_STOP_TIMEOUT);
	ASSERT_ON_ERROR(__LINE__, lRetVal);

	InitializeAppVariables();

	return lRetVal; // Success
}

//****************************************************************************
//
//! \brief Connecting to a WLAN Accesspoint
//!
//!  This function connects to the required AP (SSID_NAME) with Security
//!  parameters specified in te form of macros at the top of this file
//!
//! \param  Status value
//!
//! \return  None
//!
//! \warning    If the WLAN connection fails or we don't aquire an IP
//!            address, It will be stuck in this function forever.
//
//****************************************************************************
static long WlanConnect() {
	SlSecParams_t secParams = { 0 };
	long lRetVal = 0;

	secParams.Key = SECURITY_KEY;
	secParams.KeyLen = strlen(SECURITY_KEY);
	secParams.Type = SECURITY_TYPE;

	lRetVal = sl_WlanConnect(SSID_NAME, strlen(SSID_NAME), 0, &secParams, 0);
	ASSERT_ON_ERROR(__LINE__, lRetVal);

	// Wait for WLAN Event
	while ((!IS_CONNECTED(g_ulStatus)) || (!IS_IP_ACQUIRED(g_ulStatus))) {
		// wait till connects to an AP
		//MAP_UtilsDelay(800000);
	}

	return SUCCESS;

}

//****************************************************************************
//
//! Create an endpoint for communication and initiate connection on socket.*/
//!
//! \brief Create connection with server
//!
//! This function opens a socket and create the endpoint communication with server
//!
//! \param[in]      DestinationIP - IP address of the server
//!
//! \return         socket id for success and negative for error
//
//****************************************************************************
int CreateConnection(unsigned long DestinationIP) {
	SlSockAddrIn_t Addr;
	int Status = 0;
	int AddrSize = 0;
	int SockID = 0;

	Addr.sin_family = SL_AF_INET;
	Addr.sin_port = sl_Htons(80);
	Addr.sin_addr.s_addr = sl_Htonl(DestinationIP);

	AddrSize = sizeof(SlSockAddrIn_t);

	SockID = sl_Socket(SL_AF_INET, SL_SOCK_STREAM, 0);
	if (SockID < 0) {
		/* Error */
		UART_PRINT("Error while opening the socket\r\n");
		return -1;
	}

	Status = sl_Connect(SockID, (SlSockAddr_t *) &Addr, AddrSize);
	if (Status < 0) {
		/* Error */
		UART_PRINT("Error during connection with server\r\n");
		sl_Close(SockID);
		return -1;
	}
	return SockID;
}

//****************************************************************************
//
//! \brief Replace the existing file with the download file
//!
//! This function replaces the existing file (FILE_NAME) with the downloaded
//! file (TEMP_FILE_NAME) and deletes the temporary file.
//!
//! \param[in]      None
//!
//! \return         0 for success and negative for error
//
//****************************************************************************
int ReplaceFile(const char *sourceFile, const char *destinationFile) {
	long sfileHandle = -1;
	unsigned long sToken = 0;
	long dfileHandle = -1;
	unsigned long dToken = 0;
	long retVal = 0;
	unsigned long bytesCopied = 0, bytesReceived = 0;
	unsigned long readsize = 0;
	unsigned char buffer[MAX_BUFF_SIZE + 1];
	SlFsFileInfo_t sFileInfo;

	UART_PRINT("\r\nStarted replacing the existing file\r\n");

	// get file size
	retVal = sl_FsGetInfo((unsigned char *) sourceFile, sToken, &sFileInfo);
	if (retVal < 0) {
		// File Doesn't exit create a new of 45 KB file
		UART_PRINT("Error during opening the source file\r\n");
		retVal = sl_FsDel((unsigned char *) sourceFile, sToken);
		return -1;
	}
	bytesReceived = sFileInfo.FileLen;

	// open the source file for writing
	retVal = sl_FsOpen((unsigned char *) sourceFile, FS_MODE_OPEN_READ, &sToken, &sfileHandle);
	if (retVal < 0) {
		// File Doesn't exit create a new of 45 KB file
		UART_PRINT("Error during opening the source file\r\n");
		retVal = sl_FsDel((unsigned char *) sourceFile, sToken);
		return -1;
	}

	//delete old image
	sl_FsDel((unsigned char *) destinationFile, 0);

	// open a user file for writing
	retVal = sl_FsOpen((unsigned char *) destinationFile, FS_MODE_OPEN_WRITE, &dToken, &dfileHandle);
	if (retVal < 0) {
		// File Doesn't exit create a new of 45 KB file
		retVal = sl_FsOpen((unsigned char *) destinationFile,
				FS_MODE_OPEN_CREATE(bytesReceived, _FS_FILE_OPEN_FLAG_COMMIT | _FS_FILE_PUBLIC_WRITE | _FS_FILE_PUBLIC_READ | _FS_FILE_OPEN_FLAG_VENDOR), &dToken,
				&dfileHandle);
		if (retVal < 0) {
			retVal = sl_FsClose(sfileHandle, 0, 0, 0);
			retVal = sl_FsDel((unsigned char *) sourceFile, sToken);
			UART_PRINT("Error during opening the destination file\r\n");
			return -1;
		}
	}

	// Copy the files from temporary file to original file
	// If user file has checksum which can be used to verify the temporary
	// file then file should be verified before copying
	while (bytesCopied < bytesReceived) {
		if ((bytesReceived - bytesCopied) > READ_SIZE) readsize = READ_SIZE;
		else readsize = (bytesReceived - bytesCopied);

		memset(buffer, 0, sizeof(buffer));
		retVal = sl_FsRead(sfileHandle, bytesCopied, (unsigned char *) buffer, readsize);
		if (retVal < 0) {
			// Error close the file and delete the temporary file
			retVal = sl_FsClose(dfileHandle, 0, 0, 0);
			retVal = sl_FsClose(sfileHandle, 0, 0, 0);
			retVal = sl_FsDel((unsigned char *) sourceFile, sToken);
			UART_PRINT("Error during reading the file\r\n");
			return -1;
		}

		retVal = sl_FsWrite(dfileHandle, bytesCopied, (unsigned char *) buffer, readsize);
		if (retVal < 0) {
			// Error close the file and delete the temporary file
			retVal = sl_FsClose(sfileHandle, 0, 0, 0);
			retVal = sl_FsClose(dfileHandle, 0, 0, 0);
			retVal = sl_FsDel((unsigned char *) sourceFile, sToken);
			UART_PRINT("Error during writing the file\r\n");
			return -1;
		}
		bytesCopied += readsize;
	}

	// Close the opened files
	retVal = sl_FsClose(sfileHandle, 0, 0, 0);
	retVal = sl_FsClose(dfileHandle, 0, 0, 0);

