polybassa/WyLight/cc3200/wyLightFirmware/firmware/main.c
	UART_PRINT("File Replaced successfully\r\n");
	sl_FsDel((unsigned char *) sourceFile, sToken);

	return 0;
}

//*****************************************************************************
//
//! Application startup display on UART
//!
//! \param  none
//!
//! \return none
//!
//*****************************************************************************
static void DisplayBanner(char * AppName) {

	UART_PRINT("\n\n\n\r");
	UART_PRINT("\t\t *************************************************\n\r");
	UART_PRINT("\t\t	  CC3200 %s Application       \n\r", AppName);
	UART_PRINT("\t\t	        %s, %s          \n\r", __DATE__, __TIME__);
	UART_PRINT("\t\t *************************************************\n\r");
	UART_PRINT("\n\n\n\r");
}

//*****************************************************************************
//
//! Board Initialization & Configuration
//!
//! \param  None
//!
//! \return None
//
//*****************************************************************************
static void BoardInit(void) {
	/* In case of TI-RTOS vector table is initialize by OS itself */
#ifndef USE_TIRTOS
	//
	// Set vector table base
	//
#if defined(ccs) || defined(gcc)
	MAP_IntVTableBaseSet((unsigned long) &g_pfnVectors[0]);
#endif
#if defined(ewarm)
	MAP_IntVTableBaseSet((unsigned long)&__vector_table);
#endif
#endif
	//
	// Enable Processor
	//
	MAP_IntMasterEnable();
	MAP_IntEnable(FAULT_SYSTICK);

	PRCMCC3200MCUInit();
}

static void MainTask(void *pvParameters) {

	int retRes = 0;
	long lRetVal = -1;

	//
	// Following function configure the device to default state by cleaning
	// the persistent settings stored in NVMEM (viz. connection profiles &
	// policies, power policy etc)
	//
	// Applications may choose to skip this step if the developer is sure
	// that the device is in its desired state at start of applicaton
	//
	// Note that all profiles and persistent settings that were done on the
	// device will be lost
	//
	lRetVal = ConfigureSimpleLinkToDefaultState();
	if (lRetVal < 0) {
		if (DEVICE_NOT_IN_STATION_MODE == lRetVal) {
			UART_PRINT("Failed to configure the device in its default state\n\r");
		}

		LOOP_FOREVER(__LINE__);
	}

	UART_PRINT("Device is configured in default state \n\r");

	//
	// Assumption is that the device is configured in station mode already
	// and it is in its default state
	//
	lRetVal = sl_Start(0, 0, 0);
	if (lRetVal < 0 || ROLE_STA != lRetVal) {
		UART_PRINT("Failed to start the device \n\r");
		LOOP_FOREVER(__LINE__);
	}

	UART_PRINT("Device started as STATION \n\r");

	// Connecting to WLAN AP - Set with static parameters defined at the top
	// After this call we will be connected and have IP address
	WlanConnect();

	UART_PRINT("Connected to the AP: %s\r\n", SSID_NAME);

	// Create a TCP connection to the Web Server
	g_iSockID = CreateConnection(GetServerIP());

	if (g_iSockID < 0) return;

	UART_PRINT("Connection to server created successfully\r\n");
	// Download the file, verify the file and replace the exiting file
	if (GetFileFromServer(g_iSockID, "firmware.bin", "/temp/firmware.bin") < 0) {
		retRes = sl_Close(g_iSockID);
		UART_PRINT("Error downloading file\r\n");
		return;
	}

	retRes = sl_Close(g_iSockID);
	if (0 > retRes) {
		UART_PRINT("Error during closing socket\r\n");
		return;
	}

	g_iSockID = CreateConnection(GetServerIP());

	if (g_iSockID < 0) return;

	UART_PRINT("Connection to server created successfully\r\n");
	if (GetFileFromServer(g_iSockID, "firmware.sha", "/temp/firmware.sha") < 0) {
		retRes = sl_Close(g_iSockID);
		UART_PRINT("Error downloading file\r\n");
		return;
	}

	retRes = sl_Close(g_iSockID);
	if (0 > retRes) {
		UART_PRINT("Error during closing socket\r\n");
		return;
	}

	retRes = VerifyFile("/temp/firmware.bin", "/temp/firmware.sha");
	if (retRes < 0) {
		UART_PRINT("Error verifying files\r\n");
	}
	retRes = ReplaceFile("/temp/firmware.bin", FILE_NAME);
	if (retRes < 0) {
		UART_PRINT("Error during replacing the file\r\n");
	}

	UART_PRINT("\nThank you\r\n");
	// Stop the CC3200 device
	sl_Stop(0xFF);

	LOOP_FOREVER(__LINE__);
}

int main() {
	//
	// Board Initialization
	//
	BoardInit();

	//
	// Configure the pinmux settings for the peripherals exercised
	//
	PinMuxConfig();

	//
	// Configuring UART
	//
	InitTerm();

	//
	// Display banner
	//
	DisplayBanner(APP_NAME);

	UART_PRINT("\n\rStarted file download sample Application.");
	UART_PRINT("\n\r\n\r");

	InitializeAppVariables();

	VStartSimpleLinkSpawnTask(SPAWN_TASK_PRIORITY);

	osi_TaskCreate(MainTask, (signed char *) "MainTask", 4096, NULL, OOB_TASK_PRIORITY, NULL);

	osi_start();

	while (true)
		;

}

